app/controllers/clubs_controller.rb

SELECT "clubs".* FROM "clubs"
---
  def index
    @clubs = Club.all

SELECT "clubs".* FROM "clubs" WHERE "clubs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @club = Club.find(params[:id])

SELECT "quarters".* FROM "quarters"
---
  def new
        @user = current_user
        @quarters = Quarter.all

INSERT INTO "clubs" ("nom_club", "categorie", "recruiter_id", "quarter_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["nom_club", "szcscs"], ["categorie", "scscscs"], ["recruiter_id", 11], ["quarter_id", 1], ["created_at", "2019-09-11 11:59:24.636274"], ["updated_at", "2019-09-11 11:59:24.636274"]]
---
  def create
        @my_user = current_user.id
    @club = Club.create('nom_club' => params[:nom_club], 'categorie' => params[:categorie], quarter_id: params[:quarter_id])

  @club.recruiter_id =  @my_user

    respond_to do |format|
      if @club.save

SELECT "clubs".* FROM "clubs" WHERE "clubs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_club
      @club = Club.find(params[:id])