app/controllers/quarters_controller.rb

  def index
    @quarters = Quarter.all
---
SELECT "quarters".* FROM "quarters"