app/controllers/recrutements_controller.rb

SELECT "recrutements".* FROM "recrutements"
---
  def index
    @recrutements = Recrutement.all

SELECT "clubs".* FROM "clubs" WHERE "clubs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def new
    puts "#"*50
    puts params['data_value']

    @recrutement = Recrutement.new('content' => params[:content], 'deadline' => params[:deadline])
 @club = Club.find(params['data_value'])

INSERT INTO "recrutements" ("content", "deadline", "club_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "fdsfsdf"], ["deadline", "2020-10-10 00:00:00"], ["club_id", 1], ["created_at", "2019-09-12 07:35:06.093257"], ["updated_at", "2019-09-12 07:35:06.093257"]]
INSERT INTO "recrutements" ("club_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["club_id", 1], ["created_at", "2019-09-12 07:23:59.355382"], ["updated_at", "2019-09-12 07:23:59.355382"]]
---
  def create
    puts "aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa"
    puts params['club_id']
    @recrutement = Recrutement.create('content' => params[:content], 'deadline' => params[:deadline], club_id: params['club_id'])


    respond_to do |format|
      if @recrutement.save

SELECT "recrutements".* FROM "recrutements" WHERE "recrutements"."id" = $1 LIMIT $2  [["id", 24], ["LIMIT", 1]]
---
    def set_recrutement
      @recrutement = Recrutement.find(params[:id])